[
  {
    "url": "https://docs.adenhq.com/",
    "title": "Introduction",
    "section": "intro",
    "text": "Introduction - Aden Documentation Skip to main content Aden Documentation home page Search... ⌘ K Search... Navigation Overview Introduction Getting Started Building Agents SDKs Tools & Integrations Website Book a Call Overview Introduction What is Aden? Quickstart Self-Hosting (Alpha) Core Concepts Outcome-Driven Development Agent Architecture On this page Build Goal-Driven AI Agents Why Aden? Quick Start What Makes Aden Different Platform Components Need Help? ​ Build Goal-Driven AI Agents Aden is a platform for building AI agents that improve themselves. Define your goal through natural language, and the framework generates a node graph with dynamically created connection code. When things break, the framework captures failure data, evolves the agent, and redeploys automatically. Build Your First Agent Create a goal-driven agent in minutes with Claude Code skills. Core Concepts Understand goal-driven development and agent architecture. ​ Why Aden? Traditional agent frameworks require you to manually design workflows, define agent interactions, and handle failures reactively. Aden flips this paradigm - you describe outcomes, and the system builds itself . Goal-Driven Define objectives in natural language; the coding agent generates the agent graph and connection code. Self-Improving Framework captures failures, updates objectives, and evolves the agent graph automatically. Human-in-the-Loop Built-in intervention nodes that pause execution for human input with configurable timeouts. Production-Ready SDK-wrapped nodes with shared memory, observability, tools, and LLM access out of the box. ​ Quick Start Copy Quickstart Guide Complete setup instructions and your first agent in under 10 minutes. ​ What Makes Aden Different Traditional Frameworks Aden Hardcode agent workflows Describe goals in natural language Manual graph definition Auto-generated agent graphs Reactive error handling Proactive self-evolution Static tool configurations Dynamic SDK-wrapped nodes DIY budget management Integrated cost controls ​ Platform Components Agent Building SDK Build agents with nodes, edges, and goal-driven development. Instrumentation SDKs Track LLM calls, costs, and performance across your agents. MCP Tools Pre-built tools for financial operations and more. Testing Framework Validate agent behavior with goal-based testing. ​ Need Help? Book a Discovery Call Schedule a call with our team to learn more. What is Aden? ⌘ I",
    "code_samples": [
      "# Clone and setup\ngit clone https://github.com/adenhq/hive.git\ncd hive && ./scripts/setup-python.sh\n\n# Build an agent using Claude Code\nclaude> /building-agents\n\n# Test your agent\nclaude> /testing-agent\n\n# Run your agent\nPYTHONPATH=core:exports python -m your_agent run --input '{...}'"
    ]
  },
  {
    "url": "https://docs.adenhq.com/getting-started/quickstart",
    "title": "Quickstart",
    "section": "getting-started",
    "text": "Quickstart - Aden Documentation Skip to main content Aden Documentation home page Search... ⌘ K Search... Navigation Overview Quickstart Getting Started Building Agents SDKs Tools & Integrations Website Book a Call Overview Introduction What is Aden? Quickstart Self-Hosting (Alpha) Core Concepts Outcome-Driven Development Agent Architecture On this page Prerequisites Step 1: Clone the Repository Step 2: Run the Setup Script Step 3: Set Up Environment Step 4: Run Your First Agent Step 5: Explore Other Agents You’re Ready Next Steps By the end of this guide, you’ll have the Aden Agent Framework installed and run your first goal-driven agent. ​ Prerequisites Python Python 3.11 or higher (3.11, 3.12, or 3.13) LLM Provider API key for Anthropic (recommended) or OpenAI ​ Step 1: Clone the Repository Copy ​ Step 2: Run the Setup Script The automated setup script handles all dependencies: Copy This will: Check your Python version Install the core framework package ( ) Install the tools package ( ) Fix package compatibility issues Verify all installations Manual Setup (Alternative) If you prefer to set up manually or the script fails: Install Core Framework: Copy Install Tools Package: Copy Upgrade OpenAI Package: Copy Verify Installation: Copy ​ Step 3: Set Up Environment Create a file or export your API key: Copy For running agents with real LLMs, you’ll need an API key from Anthropic or OpenAI. You can also use mode for testing without API calls. ​ Step 4: Run Your First Agent All agent commands must be run from the project root with set: Copy Run the agent with sample input: Copy Use flag to test agents without making LLM API calls: Copy ​ Step 5: Explore Other Agents The framework includes several example agents: Copy ​ You’re Ready You now have a working agent development environment. Your agents can process inputs, make LLM calls, and execute complex workflows. ​ Next Steps Build Your Own Agent Learn how to create custom goal-driven agents Agent Performance Monitor and optimize your agent’s performance Cost Control Set budgets and alerts for LLM usage Book a Call Get help with your agent development What is Aden? Self-Hosting (Alpha) ⌘ I",
    "code_samples": [
      "git clone https://github.com/adenhq/hive\ncd hive",
      "./scripts/setup-python.sh",
      "cd core && pip install -e .",
      "cd tools && pip install -e .",
      "pip install --upgrade \"openai>=1.0.0\"",
      "python -c \"import framework; print('✓ framework OK')\"\npython -c \"import aden_tools; print('✓ aden_tools OK')\"\npython -c \"import litellm; print('✓ litellm OK')\"",
      "export ANTHROPIC_API_KEY=\"sk-ant-...\"",
      "# Validate agent structure\nPYTHONPATH=core:exports python -m support_ticket_agent validate\n\n# Show agent information\nPYTHONPATH=core:exports python -m support_ticket_agent info",
      "PYTHONPATH=core:exports python -m support_ticket_agent run --input '{\n  \"ticket_content\": \"My login is broken. Error 401.\",\n  \"customer_id\": \"CUST-123\",\n  \"ticket_id\": \"TKT-456\"\n}'",
      "PYTHONPATH=core:exports python -m support_ticket_agent run --mock --input '{...}'"
    ]
  },
  {
    "url": "https://docs.adenhq.com/concepts/overview",
    "title": "Core Concepts",
    "section": "concepts",
    "text": "What is Aden? - Aden Documentation Skip to main content Aden Documentation home page Search... ⌘ K Search... Navigation Overview What is Aden? Getting Started Building Agents SDKs Tools & Integrations Website Book a Call Overview Introduction What is Aden? Quickstart Self-Hosting (Alpha) Core Concepts Outcome-Driven Development Agent Architecture On this page Overview The Aden Advantage How It Works When to Choose Aden Next Steps ​ Overview Aden is a platform for building, deploying, and adapting AI agents. Define your goal through conversation with a coding agent, and the framework generates a node graph with dynamically created connection code. When things break, the framework captures failure data, evolves the agent through the coding agent, and redeploys. Build A Coding Agent generates specialized Worker Agents (Sales, Marketing, Ops) from natural language goals Deploy Headless deployment with CI/CD integration and full API lifecycle management Adapt Continuous evaluation, supervision, and adaptation ensure agents improve over time Infrastructure Shared memory, LLM integrations, tools, and skills power every agent ​ The Aden Advantage Traditional Frameworks Aden Hardcode agent workflows Describe goals in natural language Manual graph definition Auto-generated agent graphs Reactive error handling Proactive self-evolution Static tool configurations Dynamic SDK-wrapped nodes DIY budget management Integrated cost controls ​ How It Works Define Your Goal - Describe what you want to achieve in plain English Coding Agent Generates - Creates the agent graph, connection code, and test cases Workers Execute - SDK-wrapped nodes run with full observability and tool access Self-Improve - On failure, the system evolves the graph and redeploys automatically ​ When to Choose Aden Choose Aden when you need: Agents that self-improve from failures without manual intervention Goal-driven development where you describe outcomes, not workflows Production reliability with automatic recovery and redeployment Rapid iteration on agent architectures without rewriting code Human oversight with built-in human-in-the-loop capabilities ​ Next Steps Goal-Driven Development Learn how to define agent goals and success criteria Agent Architecture Understand nodes, edges, and the agent graph Introduction Quickstart ⌘ I",
    "code_samples": []
  },
  {
    "url": "https://docs.adenhq.com/building/first-agent",
    "title": "Build First Agent",
    "section": "building",
    "text": "Build Your First Agent - Aden Documentation Skip to main content Aden Documentation home page Search... ⌘ K Search... Navigation Agent Development Build Your First Agent Getting Started Building Agents SDKs Tools & Integrations Website Book a Call Agent Development Build Your First Agent Node Types Edge Configuration Human-in-the-Loop Testing & Quality Testing Agents On this page Prerequisites Quick Start 1. Clone and Setup 2. Install Claude Code Skills 3. Build Your Agent Example: Building a FAQ Agent Define the Goal Generated Agent Structure agent.json 4. Test Your Agent 5. Run Your Agent Project Structure Next Steps ​ Prerequisites Before building your first agent, ensure you have: Python 3.11+ installed Claude Code or another coding assistant An LLM API key (OpenAI, Anthropic, or Google) ​ Quick Start ​ 1. Clone and Setup Copy This installs: framework - Core agent runtime and graph executor aden_tools - MCP tools for agent capabilities All required dependencies ​ 2. Install Claude Code Skills Copy ​ 3. Build Your Agent Launch Claude Code and use the building skill: Copy The Coding Agent will guide you through: Defining your goal - What should the agent accomplish? Setting success criteria - How do you measure success? Adding nodes - LLM, Router, Function, or Human nodes Connecting edges - Define the execution flow Testing - Validate the agent behavior ​ Example: Building a FAQ Agent Let’s build a simple agent that answers frequently asked questions. ​ Define the Goal Copy ​ Generated Agent Structure Copy ​ agent.json Copy ​ 4. Test Your Agent Copy Or run manually: Copy ​ 5. Run Your Agent Copy Output: Copy ​ Project Structure When you build agents with Aden, they’re exported to the directory: Copy ​ Next Steps Node Types Learn about LLM, Router, Function, and Human nodes Edge Configuration Configure success, failure, and conditional edges Human-in-the-Loop Add human intervention points Testing Agents Write and run agent tests Node Types ⌘ I",
    "code_samples": [
      "# Clone the repository\ngit clone https://github.com/adenhq/hive.git\ncd hive\n\n# Run Python environment setup\n./scripts/setup-python.sh",
      "# One-time installation of building skills\n./quickstart.sh",
      "claude> /building-agents",
      "Goal: Answer customer FAQs about our product\nSuccess: Correctly answer 90% of common questions\nConstraints: Escalate to human if confidence < 0.7",
      "exports/faq_agent/\n├── __init__.py\n├── agent.json          # Agent graph specification\n├── tools.py            # Custom tool implementations\n├── prompts/\n│   └── answer.txt      # Prompt templates\n└── tests/\n    └── test_agent.py   # Test cases",
      "{\n  \"name\": \"faq-agent\",\n  \"version\": \"1.0.0\",\n  \"goal\": \"Answer customer FAQs accurately\",\n  \"nodes\": [\n    {\n      \"id\": \"classify\",\n      \"type\": \"llm\",\n      \"model\": \"claude-sonnet-4-5-20250929\",\n      \"prompt\": \"Classify this question into a category: {{question}}\"\n    },\n    {\n      \"id\": \"answer\",\n      \"type\": \"llm\",\n      \"model\": \"claude-sonnet-4-5-20250929\",\n      \"prompt\": \"Answer this FAQ: {{question}}\\nCategory: {{category}}\"\n    },\n    {\n      \"id\": \"confidence_check\",\n      \"type\": \"router\",\n      \"conditions\": [\n        {\"path\": \"respond\", \"when\": \"confidence >= 0.7\"},\n        {\"path\": \"escalate\", \"when\": \"confidence < 0.7\"}\n      ]\n    },\n    {\n      \"id\": \"escalate\",\n      \"type\": \"human\",\n      \"prompt\": \"Please answer: {{question}}\",\n      \"timeout\": \"1h\"\n    }\n  ],\n  \"edges\": [\n    {\"from\": \"classify\", \"to\": \"answer\", \"type\": \"on_success\"},\n    {\"from\": \"answer\", \"to\": \"confidence_check\", \"type\": \"on_success\"},\n    {\"from\": \"confidence_check\", \"to\": \"respond\", \"when\": \"confidence >= 0.7\"},\n    {\"from\": \"confidence_check\", \"to\": \"escalate\", \"when\": \"confidence < 0.7\"}\n  ]\n}",
      "claude> /testing-agent",
      "PYTHONPATH=core:exports python -m faq_agent run --input '{\"question\": \"What is your refund policy?\"}'",
      "PYTHONPATH=core:exports python -m faq_agent run --input '{\n  \"question\": \"How do I reset my password?\"\n}'",
      "{\n  \"answer\": \"To reset your password, click 'Forgot Password' on the login page...\",\n  \"confidence\": 0.95,\n  \"category\": \"account_management\"\n}"
    ]
  },
  {
    "url": "https://docs.adenhq.com/building/testing",
    "title": "Testing Framework",
    "section": "building",
    "text": "Testing Agents - Aden Documentation Skip to main content Aden Documentation home page Search... ⌘ K Search... Navigation Testing & Quality Testing Agents Getting Started Building Agents SDKs Tools & Integrations Website Book a Call Agent Development Build Your First Agent Node Types Edge Configuration Human-in-the-Loop Testing & Quality Testing Agents On this page Overview Quick Start Test Structure Writing Tests Basic Agent Test Testing with Mock LLM Testing Edge Paths Testing Human-in-the-Loop Testing Timeouts Test Fixtures Input Fixtures Parametrized Tests Goal-Based Testing Running Tests All Tests Specific Test With Coverage Test Configuration CI Integration Best Practices Next Steps ​ Overview Aden provides built-in testing capabilities to validate your agents before deployment. Tests verify: Goal completion - Does the agent achieve its objectives? Edge cases - How does the agent handle unusual inputs? Error handling - Does the agent recover from failures gracefully? Human-in-the-loop - Do intervention points work correctly? ​ Quick Start Use the Claude Code testing skill: Copy Or run tests manually: Copy ​ Test Structure Tests live alongside your agent: Copy ​ Writing Tests ​ Basic Agent Test Copy ​ Testing with Mock LLM Control LLM responses for deterministic tests: Copy ​ Testing Edge Paths Verify specific edge conditions: Copy ​ Testing Human-in-the-Loop Simulate human responses: Copy ​ Testing Timeouts Verify timeout behavior: Copy ​ Test Fixtures ​ Input Fixtures Copy ​ Parametrized Tests Copy ​ Goal-Based Testing Test against the agent’s defined goals: Copy ​ Running Tests ​ All Tests Copy ​ Specific Test Copy ​ With Coverage Copy ​ Test Configuration Configure test behavior in : Copy ​ CI Integration Example GitHub Actions workflow: Copy ​ Best Practices Mock External Calls Use mocks for LLMs and APIs to ensure deterministic tests Test Edge Cases Include empty inputs, long inputs, and malformed data Test All Paths Verify each edge in your graph is exercised by tests Test HITL Flows Simulate approval, rejection, and timeout scenarios ​ Next Steps Build Your First Agent Start building if you haven’t already Node Types Review available node types Human-in-the-Loop ⌘ I",
    "code_samples": [
      "claude> /testing-agent",
      "PYTHONPATH=core:exports pytest exports/your_agent/tests/",
      "exports/your_agent/\n├── agent.json\n├── tools.py\n└── tests/\n    ├── __init__.py\n    ├── test_agent.py\n    ├── test_nodes.py\n    └── fixtures/\n        ├── sample_inputs.json\n        └── expected_outputs.json",
      "import pytest\nfrom framework.testing import AgentTestCase, MockLLM\n\nclass TestFAQAgent(AgentTestCase):\n    agent_path = \"exports/faq_agent\"\n\n    def test_answers_common_question(self):\n        \"\"\"Agent should answer common FAQ correctly.\"\"\"\n        result = self.run_agent({\n            \"question\": \"What is your refund policy?\"\n        })\n\n        assert result.success\n        assert \"refund\" in result.output[\"answer\"].lower()\n        assert result.output[\"confidence\"] > 0.7\n\n    def test_escalates_complex_question(self):\n        \"\"\"Agent should escalate questions it can't answer.\"\"\"\n        result = self.run_agent({\n            \"question\": \"Can you explain quantum entanglement?\"\n        })\n\n        assert result.escalated\n        assert result.escalation_node == \"human_review\"",
      "def test_with_mock_llm(self):\n    mock_llm = MockLLM({\n        \"classify\": {\"category\": \"billing\", \"confidence\": 0.95},\n        \"generate_response\": {\"answer\": \"Your bill is due on the 15th.\"}\n    })\n\n    result = self.run_agent(\n        {\"question\": \"When is my bill due?\"},\n        llm=mock_llm\n    )\n\n    assert result.output[\"answer\"] == \"Your bill is due on the 15th.\"",
      "def test_high_risk_triggers_review(self):\n    \"\"\"High risk score should trigger human review.\"\"\"\n    mock_llm = MockLLM({\n        \"analyze_risk\": {\"risk_score\": 0.9, \"factors\": [\"unusual_amount\"]}\n    })\n\n    result = self.run_agent(\n        {\"transaction\": {\"amount\": 50000}},\n        llm=mock_llm\n    )\n\n    # Verify the path taken\n    assert \"human_review\" in result.nodes_executed\n    assert result.paused_at == \"human_review\"",
      "def test_approval_flow(self):\n    \"\"\"Test the approval workflow.\"\"\"\n    result = self.run_agent(\n        {\"refund_amount\": 500},\n        human_responses={\n            \"manager_approval\": {\"approved\": True, \"notes\": \"Looks good\"}\n        }\n    )\n\n    assert result.success\n    assert result.output[\"status\"] == \"refunded\"\n\ndef test_rejection_flow(self):\n    \"\"\"Test rejection handling.\"\"\"\n    result = self.run_agent(\n        {\"refund_amount\": 500},\n        human_responses={\n            \"manager_approval\": {\"approved\": False, \"reason\": \"Suspicious activity\"}\n        }\n    )\n\n    assert not result.success\n    assert result.output[\"status\"] == \"rejected\"",
      "def test_timeout_auto_rejects(self):\n    \"\"\"Timeout should auto-reject when configured.\"\"\"\n    result = self.run_agent(\n        {\"refund_amount\": 500},\n        human_responses={\n            \"manager_approval\": \"timeout\"\n        }\n    )\n\n    assert result.output[\"status\"] == \"rejected\"\n    assert result.output[\"reason\"] == \"approval_timeout\"",
      "// tests/fixtures/sample_inputs.json\n{\n  \"common_questions\": [\n    {\"question\": \"What is your refund policy?\", \"expected_category\": \"billing\"},\n    {\"question\": \"How do I reset my password?\", \"expected_category\": \"account\"},\n    {\"question\": \"What are your business hours?\", \"expected_category\": \"general\"}\n  ],\n  \"edge_cases\": [\n    {\"question\": \"\", \"should_fail\": true},\n    {\"question\": \"a\".repeat(10000), \"should_truncate\": true}\n  ]\n}",
      "import json\n\ndef load_fixtures():\n    with open(\"tests/fixtures/sample_inputs.json\") as f:\n        return json.load(f)\n\n@pytest.mark.parametrize(\"case\", load_fixtures()[\"common_questions\"])\ndef test_common_questions(self, case):\n    result = self.run_agent({\"question\": case[\"question\"]})\n    assert result.output[\"category\"] == case[\"expected_category\"]"
    ]
  },
  {
    "url": "https://docs.adenhq.com/mcp-server/introduction",
    "title": "MCP Tools",
    "section": "mcp",
    "text": "MCP Server Introduction - Aden Documentation Skip to main content Aden Documentation home page Search... ⌘ K Search... Navigation MCP Server MCP Server Introduction Getting Started Building Agents SDKs Tools & Integrations Website Book a Call MCP Server MCP Server Introduction Installation Configuration Financial Tools Tools Overview Report Tools Journal Entry Tools Bill Tools (AP) Invoice Tools (AR) Accounting Period Tools Chart of Accounts Tools On this page What is the Aden MCP Server? Features Tool Categories Approval Workflow Tool Naming Convention Next Steps ​ What is the Aden MCP Server? The Aden MCP Server exposes Aden’s General Ledger, Accounts Payable, Accounts Receivable, and financial reporting APIs to AI agents like Claude through the Model Context Protocol (MCP) . This enables AI assistants to: Create and manage journal entries Process bills and invoices Generate financial reports Execute approval workflows Manage chart of accounts and accounting periods ​ Features 82 Financial Tools Comprehensive toolset covering all financial operations Multi-Level Approvals Full support for approval workflows with L1/L2 approvals Multiple Transports stdio for Claude Desktop, HTTP/SSE for web clients Audit Trail Complete audit logging with idempotency keys ​ Tool Categories Category Tools Description Reports 10 Trial Balance, Income Statement, Balance Sheet, Cash Flow, GL Report, Account Activity, Aged Receivables/Payables, Budget vs Actual, Custom Reports Journal Entries 16 Full CRUD + multi-level approval workflow Bills (AP) 18 Full CRUD + approval workflow + payments Invoices (AR) 19 Full CRUD + approval workflow + payments + email Accounting Periods 10 Period management, close/reopen, sub-ledger locks Chart of Accounts 9 Account management, hierarchy, balances ​ Approval Workflow The MCP server supports Aden’s multi-level approval workflow: Copy All workflow actions include: Idempotency keys for safe retries Full audit trail for compliance Hold/Unhold actions for temporary pauses ​ Tool Naming Convention All tools follow the pattern: Examples: ​ Next Steps Installation Set up the MCP server Configuration Configure authentication and transport Tools Reference Browse available tools Installation ⌘ I",
    "code_samples": [
      "Draft → Submit → Approve L1 → Approve L2 → Post\n           ↓\n     Reject / Request Change / Hold",
      "finance_{domain}_{action}",
      "finance_journal_entry_create",
      "finance_bill_approve_l1",
      "finance_report_trial_balance",
      "finance_period_close"
    ]
  }
]